Revit 2020 API
PartUtils.GetSplittingCurves Method (Document, ElementId)
 Identifies the curves that were used to create the part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2019.1
Syntax
C#
public static IList<Curve> GetSplittingCurves(
	Document document,
	ElementId partId
)
Visual Basic
Public Shared Function GetSplittingCurves ( _
	document As Document, _
	partId As ElementId _
) As IList(Of Curve)
Visual C++
public:
static IList<Curve^>^ GetSplittingCurves(
	Document^ document,
	ElementId^ partId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The source document of the part.
partId
Type: Autodesk.Revit.DB.ElementId
 The part id.
Return Value
 The curves that created the part. Empty if partId is not a Part or Part is not divided.
Examples
CopyC#
public void GetCurveDividers(Part part)
{
   StringBuilder message = new StringBuilder();
   // Get curve dividers.
   IList<Curve> divisionCurves = PartUtils.GetSplittingCurves(part.Document, part.Id);
   if (divisionCurves.Count == 0)
      message.AppendLine("Part is not divided.");
   else
   {
      message.AppendLine("The dividers are : ");
      if (divisionCurves.Count > 0)
         message.AppendLine(divisionCurves.Count.ToString() + " division curves");
   }
   TaskDialog.Show("Revit", message.ToString());
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
PartUtils Class
GetSplittingCurves Overload
Autodesk.Revit.DB Namespace